import { removeUnicode } from "./utils";
import { expect, test } from "vitest";

test("should correctly replace Unicode entities and HTML entities", () => {
	const input =
		"הקרבה למשרדים, האווירה הליברלית והמשכורת המאפשרת מגורים באזורים מבוקשים, הביאו לכך שאחד מכל ארבעה תושבים בשכונות הצפוניות של תל אביב הוא הייטקיסט &amp;#8226; מחקר חדש שערכה חברת מדלן, שהגיע לידי גלובס, מלמד על העדפות המגורים של אנשי ההייטק &amp;#8226; ובאילו ערים גדולות שיעורם נמוך במיוחד?";

	const expectedOutput =
		"הקרבה למשרדים, האווירה הליברלית והמשכורת המאפשרת מגורים באזורים מבוקשים, הביאו לכך שאחד מכל ארבעה תושבים בשכונות הצפוניות של תל אביב הוא הייטקיסט &• מחקר חדש שערכה חברת מדלן, שהגיע לידי גלובס, מלמד על העדפות המגורים של אנשי ההייטק &• ובאילו ערים גדולות שיעורם נמוך במיוחד?";

	const result = removeUnicode(input);

	expect(result).toBe(expectedOutput);
});
